# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Binaries
brew "autojump"
brew "coreutils"
brew "git"
brew "git-delta"
brew "go"
brew "imagemagick"
brew "jq"
brew "mas"
brew "pyenv"
brew "pyenv-virtualenv"
brew "shellcheck"
brew "tldr"
brew "tree"
brew "wget"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps
cask "1password"
cask "arc"
cask "appcleaner"
cask "cheatsheet"
cask "docker"
cask "eudic"
cask "feishu"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "iterm2"
cask "microsoft-outlook"
cask "monitorcontrol"
cask "notion"
cask "postman"
cask "qq"
cask "raycast"
cask "snipaste"
cask "the-unarchiver"
cask "visual-studio-code"

# Quicklook
cask "provisionql"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookapk"
cask "webpquicklook"

# Fonts
cask "font-meslo-lg-nerd-font"

# Mac App Store
mas "Magnet", id: 441258766
mas "Ulysses", id: 1225570693
mas "滴答清单", id: 966085870
mas "微信", id: 836500024
