# Taps
tap "homebrew/bundle"

# Binaries
brew "coreutils"
brew "fzf"
brew "htop"
brew "gemini-cli"
brew "git"
brew "git-delta"
brew "imagemagick"
brew "jq"
brew "mas"
brew "nvm"
brew "ollama"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "temporal"
brew "tldr"
brew "tree"
brew "wget"
brew "yq"

# Apps
cask "1password"
cask "alt-tab"
cask "antigravity"
cask "appcleaner"
cask "cheatsheet"
cask "claude-code"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "easydict"
cask "gcloud-cli"
cask "google-chrome"
cask "iina"
cask "lark"
cask "linear-linear"
cask "mongodb-compass"
cask "monitorcontrol"
cask "postman"
cask "pycharm"
cask "raycast"
cask "redis-insight"
cask "surge"
cask "snipaste"
cask "the-unarchiver"
cask "timing"
cask "typeless"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# Quicklook
cask "provisionql"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookapk"
cask "webpquicklook"
